/*
Необходимо попросить пользователя ввести три числа.
Необходимо создать функцию, в которую мы должны передать эти три числа.
Функция должна определить максимальное, среди переданных ей значение и 
вывести сообщение: "Максимальное значение среди чисел N1, N2, N3 равно N."

Примечание: Условимся, что пользователь всегда вводит корректные значения, 
три числа. Проверять их не нужно.
*/

/*
let number1 = +prompt("Задача 3: " + "Введите первое число: ");
let number2 = +prompt("Задача 3: " + "Введите второе число: ");
let number3 = +prompt("Задача 3: " + "Введите третье число: ");

function getMax(number1, number2, number3) {
  const max = 0;
  if (number1 > number2) {
    max = number1;
  } else {
    max = number2;
  }
  if (number3 > max) {
    max = number3;
  }
  return max;
}
console.log(
  `Максимальное значение среди чисел ${number1}, ${number2}, ${number3} равно ` +
    Math.max(number1, number2, number3)
);
*/
